import {Component} from '@angular/core';

@Component({
  selector: 'app-interesting',
  template: `<p><b>«Я зрелая личность!» – думает современный человек, в большинстве своем инфантильный по своей
    сути.
    Многие взрослые люди ведут себя как незрелые подростки, но даже об этом не подозревают. Как ведет себя инфантильный
    субъект и чем отличается от зрелого человека, об этом пойдет речь в статье.</b></p>

  <p>Что такое <b>инфантильность</b>?
    Инфантильность – это характеристика личности, выражающая незрелость её психологического развития, сохранение черт,
    присущих более ранним возрастным этапам.</p>

  <p>В детстве человек чувствует себя защищенным. Рядом с ним всегда его мама, папа и другие взрослые, которые готовы
    прийти на помощь, защитить, взять на себя ответственность, подстраховать, похвалить, приласкать. Потребность в
    защите переносится во взрослую жизнь, и если человек не удовлетворяет ее, то компенсирует самыми разными способами и
    впадает в инфантилизм.</p>

  <p>Известный психоаналитик Зигмунд Фрейд писал: «Даже здоровые, хорошо приспособленные люди позволяют себе время от
    времени регрессии: курят, напиваются, переедают, выходят из себя, кусают ногти, ковыряют в носу, читают рассказы о
    таинственном, ходят в кино, нарушают законы, лепечут по-детски, портят вещи, мастурбируют, занимаются необычным
    сексом, жуют резинку или табак, одеваются как дети и делают тысячи других «детских» вещей. Многие из этих регрессий
    настолько общеприняты, что принимаются за признаки зрелости. В действительности все это — формы регрессии,
    используемые взрослыми».</p>


  <p><b>Как проявляется инфантильность?</b>
    Незрелая личность проявляется в прямых незрелых поступках или опосредовано в каких-то привычных проявлениях, которые
    не воспринимаются многими из нас как проявления незрелости. Иногда мы даже не отдаем себе отчета, что некоторые наши
    поступки являются проявлением инфантилизма, мешают нашей самореализации и препятствуют нашему счастью. Незрелая или
    инфантильная личность может стать настоящим бедствием для окружающих людей, вынужденных бросаться на амбразуру чужих
    проблем и терпеть последствия чужих ошибок. Но она вредит не только окружающим, а прежде всего самой себе.</p><br>

  <b>Как же проявляется психологическая и эмоциональная незрелость?</b>
    <ul>
    <li> В несамостоятельности мышления и поступков. Инфантильные люди ищут учителей, советчиков и идейных
      вдохновителей.
      Они часто обращаются к психологам, экстрасенсам, целителям, гадалкам, другим авторитетам, чтобы те подсказали им
      правильные решения, а лучше – сделали бы все за них. Такие люди тяготеют к созданию мифов о всемогущих и
      всезнающих
      личностях, в руки которых они готовы отдать свою жизнь и следовать всем спущенным сверху распоряжениям и
      установкам.
      Даже становясь родителями, руководителями, влиятельными особами, они как будто все время оглядываются на кого-то
      более умного, опытного, авторитетного и ждут от него помощи, подсказки, совета, решения. Думают, что кто-то
      сделает
      и решит то, что должны сделать и решить они сами. Ка́рен Хо́рни — американский психоаналитик и психолог – считает,
      что «данный тип чувствует себя потерянным, подобно лодке, потерявшей свой якорь, и демонстрирует особую
      потребность
      в партнере, который должен взять на себя ответственность за все доброе и злое...»
    </li>

    <li> Незрелая личность «бежит» от ответственности (от жизни). Как ребенок, который боится неизвестности, незрелый
      человек всячески пытается избежать непредсказуемости постоянно изменяющихся обстоятельств, подстелить соломки,
      предусмотреть все неожиданности и проконтролировать все происходящие вокруг процессы. Иногда, чтобы спастись от
      жизни, инфантильные личности уходят в себя, погружаются с головой в работу, в творчество, в науку, в другого
      человека (растворяются в своем возлюбленном). Для того чтобы надежно спрятаться от сложностей жизни в качестве
      агентов зависимости используется алкоголь, наркотики, магия, азартные игры, религиозные секты и т.д. Убегая от
      жизни, человек избегает отношений, боится проявить свою индивидуальность, высказать свое мнение. Он перекладывает
      ответственность на других или просто убегает от нее, ничего не предпринимая.
    </li>

    <li> Незрелая личность ищет виноватых. От невозможности взять ответственность за свою жизнь на себя спасает
      непрерывный
      поиск тех, кто сделает это за инфантильного человека. У него всегда найдется виновник всех происходящих с ним
      событий. От родителей, не давших ему надежного стартового капитала, до президента, который не заботится о нем как
      о
      гражданине своей страны. Перекладывание с больной головы на – здоровую, поиски козла отпущения, переадресация
      полномочий, сбрасывание ответственности – все это проявления психологической и эмоциональной незрелости. Как
      правило, во время поиска виноватых обнаруживаются такие побочные явления, как недовольство жизнью, сплетни,
      жалобы,
      критиканство, стремление командовать другими, указывать им, как поступать и в чем они неправы.
    </li>

    <li> Инфантильные люди предпочитают сослагательное наклонение. Они пребывают либо в прошлом, либо в будущем,
      постоянно
      аргументируя свои просчеты фразами, типа «вот если бы я жил в Париже (Лондоне, Сингапуре и т.д.), то со мной
      никогда
      такого не случилось…», «если бы у меня был парень…», «если бы мне удалось устроиться на эту работу…», «если бы я
      была замужем…», «если бы я имела отдельную квартиру (дачу, гараж, виллу и т.д.), «если бы у меня был сын…» – и так
      до бесконечности. Инфантильный хочет больше, чем у него есть и чего он заслуживает, в итоге, теряет уже имеющееся.
      Находясь в плену своих несбыточных фантазий, которые отвлекают и утешают в условиях реального «здесь и сейчас»,
      незрелые личности лихорадочно меняют партнеров, места работы, жительства, внешние атрибуты благополучия и т.д. И
      не
      понимают, что куда бы они ни уехали и что бы ни поставили в свой гараж, сами они не изменяются. И проблемы их
      заключаются не в людях и не обстоятельствах, а находятся внутри них самих.
    </li>

    <li> Незрелая личность боится быть собой. Ей постоянно нужно утверждаться за счет других, пиариться, выставлять себя
      напоказ, находиться в непрерывном тонусе признания и одобрения. Поэтому им никак невозможно показывать свою
      слабость, глупость, невыносимо быть смешными и глупыми. А чтобы показать свою важность и значимость, им порой
      просто
      необходимо унизить других, покритиковать их, сделать замечание, сравнить себя с ними. Они не уверены в себе,
      страдают комплексами, не любит себя и, как голодные волки, рыскают по свету за любовью окружающих и их вниманием.
      И
      всеми правдами и неправдами этого добиваются. Чаще всего с помощью «демонстраций» разного рода: от жалоб и
      страданий
      до самопрезентаций своей «крутости». Одним из проявлений боязни быть собой является конформизм. Как сказал Эрих
      Фромм (немецкий социолог, философ и психоаналитик), «индивид перестает быть собой, он полностью усваивает тип
      личности, предлагаемый ему общепринятым шаблоном, и становится точно таким же, как все остальные».
    </li>
  </ul>
  <p>Можно добавить еще множество проявлений незрелой личности, но главная заключается в том, что она не является
    хозяином собственной жизни, не несет за нее ответственность и, как большой ребенок, ищет оправданий для своей
    бездеятельности или отстраненности от решения реальных жизненных проблем.</p>

  <b>Зрелая личность</b>
  • не просто знает, но и умеет (узнаёт, как это сделать);
  • не просто мечтает и надеется, а действует и принимает решения;
  • не озабочена чужими недостатками, а работает над исправлением своих собственных;
  • не пытается управлять другими, исправлять их и критиковать, а управляет собой и работает над собой;
  • не ждет решений от кого-то, а решает сама;
  • добивается того, чтобы быть лучше, а не выглядеть лучше;
  • извлекают опыт из ошибок, а не впадают от них в уныние;
  • расправляется с проблемами по мере их поступления, а не прокрастинирует (то есть не откладывает в долгий ящик).

  <p><b>Инфантильность – обратная сторона эгоцентризма</b>
    Ребенок, привыкший к тому, что все крутиться вокруг него, сохраняется в незрелой личности и постоянно диктует ему
    поступки, вытекающие из его эгоцентризма. Таким людям трудно понять, что другие имеют</p>
  <ul>
    <li> собственные интересы, мнения и потребности;</li>
    <li> ограничены во времени, силах, возможностях;</li>
    <li> не обязаны им ничем.</li>
  </ul>
  <p>Относясь к другим с потребительской точки зрения, подчиняя себе, заключая в тиски эмоциональной и психологической
    зависимости, они думают, что любят другого человека, растворившись в нем или возлагая на него непомерные надежды на
    обретение собственного счастья. Но по существу, проявляют не любовь, а свой эгоизм. По мнению К. Хорни, незрелый
    человек «ошибочно принимает свою потребность в любви и привязанности и все, что вытекает из нее, за подлинную
    способность любить и полностью упускает свои агрессивные и даже разрушительные наклонности».</p>

  <p>Инфантильность – черта постсоветского общества, связанная с тем, что нас долго приучали к тому, что кто-то сделает
    или решит за нас (государство, управдом, милиционер, начальник и т.д.). Мы не бросаемся сами тушить пожар, мы ждем,
    когда приедет пожарная машина, и с ужасом наблюдаем, как гибнут люди. То же самое метафорично можно сказать о нашей
    жизни: мы не действуем, мы ждем, что ее устроит кто-то. Какой-то мистический волшебник, принц на белом коне, чародей
    из другой страны, более опытный и богатый партнер явится и все решит (порешает), а мы сами и с места не сдвинемся,
    чтобы потушить перманентные пожары, то и дело возникающие в нашей жизни.</p>

  <p>Инфантильность – недостаток не только наш, это общая черта всех потребителей современного мира, избалованных
    достижениями цивилизации. Современный человек окружен бесконечным количеством «агентов зависимости», которые
    помогают ему справиться с жизнью (от зубной щетки до компьютера). Он так к этому привыкает, что не утруждает себя
    даже элементарными усилиями. Привычка потреблять изгоняет из человека привычку созидать, самостоятельно принимать
    решения, нести ответственность, действовать и т.п.</p>

  <p>Но не все так плохо, у нас все-таки есть шанс стать зрелой личностью со своим собственным лицом. Потому что
    инфантильность – это не болезнь, а всего лишь проявление эгоцентризма человека, и с ней можно бороться, работая над
    собой.<br>
    Источник: <a
      href="https://www.myjane.ru/articles/text/?id=19826">"https://www.myjane.ru/articles/text/?id=19826"</a></p>`,
  styles: [`li:nth-child(2n+1) {
    color: darkblue;
    background-color: lightblue
  }
  li:nth-child(2n) {
    color: darkblue;
    background-color: lightpink
  }`]
})
export class InterestingPublishComponent {
}
